*&---------------------------------------------------------------------*
*& Include          ZBK_SEHIR_LISTELEME_MDL
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Module STATUS_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
*Ekrana veri göndermeden önce çalışacaklar
MODULE status_0100 OUTPUT.
*  ana classımızın nesnesi  pbo_0100 ise metot
  go_main->pbo_0100( ).
ENDMODULE.
*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
*Kullanıcı input yaptıktan sonra çalışacaklar
MODULE user_command_0100 INPUT.
*                             BACK EXIT save fonksiyon kodları
  go_main->pai_0100( iv_ucomm = sy-ucomm ).
ENDMODULE.
